{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\rqamar\Downloads\Reem_Metrics_PS4.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 6 Dec 2023, 15:29:03

{com}. do "C:\Users\rqamar\AppData\Local\Temp\STD5b88_000000.tmp"
{txt}
{com}. use "C:\Users\rqamar\Downloads\ccapm.dta", clear
{txt}
{com}. 
. gen cratio_lag = cratio[_n-1]
{txt}(1 missing value generated)

{com}. gen rrate_lag = rrate[_n-1]
{txt}(1 missing value generated)

{com}. gen e_lag = e[_n-1]
{txt}(1 missing value generated)

{com}. 
. //(a)//
. gmm ({c -(}b=1{c )-}*(cratio^(-{c -(}g=1{c )-}))*rrate-1), inst(cratio_lag rrate_lag e_lag)
{res}
{txt}Step {res}1
{txt}Iteration 0:{space 2}GMM criterion Q(b) = {res:  .0000144}  
Iteration 1:{space 2}GMM criterion Q(b) = {res: .00001312}  
Iteration 2:{space 2}GMM criterion Q(b) = {res: .00001312}  

{txt}Step {res}2
{txt}Iteration 0:{space 2}GMM criterion Q(b) = {res: .00603693}  
Iteration 1:{space 2}GMM criterion Q(b) = {res: .00534195}  
Iteration 2:{space 2}GMM criterion Q(b) = {res: .00534195}  
{res}
{txt}GMM estimation 

{col 1}Number of parameters = {col 24}{res}  2
{txt}{col 1}Number of moments    = {col 24}{res}  4
{txt}{col 1}Initial weight matrix: {col 24}{res}Unadjusted{txt}{col 51}Number of obs{col 67}= {res}       237
{txt}{col 1}GMM weight matrix: {col 24}{res}Robust

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          /b {c |}{col 14}{res}{space 2} .9976933{col 26}{space 2} .0043145{col 37}{space 1}  231.24{col 46}{space 3}0.000{col 54}{space 4}  .989237{col 67}{space 3}  1.00615
{txt}          /g {c |}{col 14}{res}{space 2} .7144645{col 26}{space 2} 1.760412{col 37}{space 1}    0.41{col 46}{space 3}0.685{col 54}{space 4}-2.735879{col 67}{space 3} 4.164808
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 4 4}{txt}Instruments for equation {res}1{txt}: {res}cratio_lag rrate_lag e_lag _cons{p_end}
{txt}
{com}. 
. //(b)//
. gen time = _n
{txt}
{com}. gmm ({c -(}b=1{c )-}*(cratio^(-{c -(}g=1{c )-}))*rrate-1), inst(cratio_lag rrate_lag e_lag) wmatrix(hac ba 5)
{res}
{txt}Step {res}1
{txt}Iteration 0:{space 2}GMM criterion Q(b) = {res:  .0000144}  
Iteration 1:{space 2}GMM criterion Q(b) = {res: .00001312}  
Iteration 2:{space 2}GMM criterion Q(b) = {res: .00001312}  

{txt}Step {res}2
{txt}Iteration 0:{space 2}GMM criterion Q(b) = {res: .00840257}  
Iteration 1:{space 2}GMM criterion Q(b) = {res: .00785394}  
Iteration 2:{space 2}GMM criterion Q(b) = {res: .00785394}  
{res}
{txt}GMM estimation 

{col 1}Number of parameters = {col 24}{res}  2
{txt}{col 1}Number of moments    = {col 24}{res}  4
{txt}{col 1}Initial weight matrix: {col 24}{res}Unadjusted{txt}{col 51}Number of obs{col 67}= {res}       237
{txt}{col 1}GMM weight matrix: {col 24}{res}HAC Bartlett 5

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}      HAC
{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          /b {c |}{col 14}{res}{space 2}  .997831{col 26}{space 2}  .004389{col 37}{space 1}  227.35{col 46}{space 3}0.000{col 54}{space 4} .9892288{col 67}{space 3} 1.006433
{txt}          /g {c |}{col 14}{res}{space 2} .7768128{col 26}{space 2} 1.765982{col 37}{space 1}    0.44{col 46}{space 3}0.660{col 54}{space 4}-2.684449{col 67}{space 3} 4.238074
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
HAC standard errors based on {res}Bartlett {txt}kernel with {res}5{txt} lags.
{p 0 4 4}{txt}Instruments for equation {res}1{txt}: {res}cratio_lag rrate_lag e_lag _cons{p_end}
{txt}
{com}. 
. clear all
{res}{txt}
{com}. 
. ////PROBLEM 4////
> use "C:\Users\rqamar\Downloads\MURDER.DTA", clear
{txt}
{com}. //(a)//
. reg mrdrte exec unem d90 d93

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       153
{txt}{hline 13}{c +}{hline 34}   F(4, 148)       = {res}     3.05
{txt}       Model {c |} {res} 977.390644         4  244.347661   {txt}Prob > F        ={res}    0.0190
{txt}    Residual {c |} {res} 11867.9475       148  80.1888343   {txt}R-squared       ={res}    0.0761
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0511
{txt}       Total {c |} {res} 12845.3381       152  84.5088034   {txt}Root MSE        =   {res} 8.9548

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      mrdrte{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}exec {c |}{col 14}{res}{space 2} .1627547{col 26}{space 2} .1939295{col 37}{space 1}    0.84{col 46}{space 3}0.403{col 54}{space 4}-.2204738{col 67}{space 3} .5459832
{txt}{space 8}unem {c |}{col 14}{res}{space 2} 1.390786{col 26}{space 2} .4508653{col 37}{space 1}    3.08{col 46}{space 3}0.002{col 54}{space 4} .4998207{col 67}{space 3} 2.281751
{txt}{space 9}d90 {c |}{col 14}{res}{space 2} 2.675335{col 26}{space 2} 1.816934{col 37}{space 1}    1.47{col 46}{space 3}0.143{col 54}{space 4}  -.91515{col 67}{space 3}  6.26582
{txt}{space 9}d93 {c |}{col 14}{res}{space 2} 1.607317{col 26}{space 2} 1.774768{col 37}{space 1}    0.91{col 46}{space 3}0.367{col 54}{space 4}-1.899842{col 67}{space 3} 5.114476
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.864393{col 26}{space 2} 3.069517{col 37}{space 1}   -0.61{col 46}{space 3}0.545{col 54}{space 4}-7.930134{col 67}{space 3} 4.201349
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //(b)//
. xtset id year
{res}
{col 1}{txt:Panel variable: }{res:id}{txt: (strongly balanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:87}}{txt: to }{res:{bind:93}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. xtreg mrdrte exec unem d90 d93, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}       153
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}        51

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.0734{col 63}{txt}min{col 67}={col 69}{res}         3
{txt}     Between = {res}0.0037{col 63}{txt}avg{col 67}={col 69}{res}       3.0
{txt}     Overall = {res}0.0108{col 63}{txt}max{col 67}={col 69}{res}         3

{txt}{col 49}F({res}4{txt}, {res}98{txt}){col 67}={col 70}{res}     1.94
{txt}corr(u_i, Xb) = {res}0.0010{txt}{col 49}Prob > F{col 67}={col 73}{res}0.1098

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      mrdrte{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}exec {c |}{col 14}{res}{space 2}-.1383231{col 26}{space 2} .1770059{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-.4895856{col 67}{space 3} .2129395
{txt}{space 8}unem {c |}{col 14}{res}{space 2} .2213158{col 26}{space 2} .2963756{col 37}{space 1}    0.75{col 46}{space 3}0.457{col 54}{space 4} -.366832{col 67}{space 3} .8094636
{txt}{space 9}d90 {c |}{col 14}{res}{space 2} 1.556215{col 26}{space 2} .7453273{col 37}{space 1}    2.09{col 46}{space 3}0.039{col 54}{space 4} .0771369{col 67}{space 3} 3.035293
{txt}{space 9}d93 {c |}{col 14}{res}{space 2} 1.733242{col 26}{space 2} .7004381{col 37}{space 1}    2.47{col 46}{space 3}0.015{col 54}{space 4} .3432454{col 67}{space 3} 3.123239
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.822104{col 26}{space 2} 1.915611{col 37}{space 1}    3.04{col 46}{space 3}0.003{col 54}{space 4} 2.020636{col 67}{space 3} 9.623572
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 8.7527226
     {txt}sigma_e {c |} {res} 3.5214244
         {txt}rho {c |} {res} .86068589{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}50{txt}, {res}98{txt}) = {res}17.18{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. 
. mat betafe=get(_b)
{txt}
{com}. mat Vfe=get(VCE)
{txt}
{com}. 
. //(c)//
. xi: qui reg mrdrte i.id
{txt}i.id{col 19}_Iid_1-51{col 39}(naturally coded; _Iid_1 omitted)

{com}. predict rmrdrte, residuals
{txt}
{com}. xi: qui reg exec i.id
{txt}i.id{col 19}_Iid_1-51{col 39}(naturally coded; _Iid_1 omitted)

{com}. predict rexec, residuals
{txt}
{com}. xi: qui reg unem i.id
{txt}i.id{col 19}_Iid_1-51{col 39}(naturally coded; _Iid_1 omitted)

{com}. predict runem, residuals
{txt}
{com}. xi: qui reg d90 i.id
{txt}i.id{col 19}_Iid_1-51{col 39}(naturally coded; _Iid_1 omitted)

{com}. predict rd90, residuals
{txt}
{com}. xi: qui reg d93 i.id
{txt}i.id{col 19}_Iid_1-51{col 39}(naturally coded; _Iid_1 omitted)

{com}. predict rd93, residuals
{txt}
{com}. 
. reg rmrdrte rexec runem rd90 rd93, noconstant

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       153
{txt}{hline 13}{c +}{hline 34}   F(4, 149)       = {res}     2.95
{txt}       Model {c |} {res} 96.2178837         4  24.0544709   {txt}Prob > F        ={res}    0.0221
{txt}    Residual {c |} {res} 1215.24215       149  8.15598758   {txt}R-squared       ={res}    0.0734
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0485
{txt}       Total {c |} {res} 1311.46003       153  8.57163421   {txt}Root MSE        =   {res} 2.8559

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     rmrdrte{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}rexec {c |}{col 14}{res}{space 2}-.1383231{col 26}{space 2} .1435515{col 37}{space 1}   -0.96{col 46}{space 3}0.337{col 54}{space 4}-.4219827{col 67}{space 3} .1453366
{txt}{space 7}runem {c |}{col 14}{res}{space 2} .2213158{col 26}{space 2} .2403601{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4}-.2536389{col 67}{space 3} .6962706
{txt}{space 8}rd90 {c |}{col 14}{res}{space 2} 1.556215{col 26}{space 2} .6044591{col 37}{space 1}    2.57{col 46}{space 3}0.011{col 54}{space 4} .3617955{col 67}{space 3} 2.750634
{txt}{space 8}rd93 {c |}{col 14}{res}{space 2} 1.733242{col 26}{space 2} .5680541{col 37}{space 1}    3.05{col 46}{space 3}0.003{col 54}{space 4} .6107597{col 67}{space 3} 2.855724
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //(d)//
. xtreg mrdrte exec unem d90 d93
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}       153
{txt}Group variable: {res}id                              {txt}Number of groups  = {res}        51

{txt}R-squared:                                      Obs per group:
     Within  = {res}0.0680                                         {txt}min = {res}         3
{txt}     Between = {res}0.0731                                         {txt}avg = {res}       3.0
{txt}     Overall = {res}0.0426                                         {txt}max = {res}         3

                                                {txt}Wald chi2({res}4{txt})      =  {res}     8.52
{txt}corr(u_i, X) = {res}0{txt} (assumed)                      Prob > chi2       =     {res}0.0743

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      mrdrte{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}exec {c |}{col 14}{res}{space 2}-.0543375{col 26}{space 2} .1595008{col 37}{space 1}   -0.34{col 46}{space 3}0.733{col 54}{space 4}-.3669533{col 67}{space 3} .2582784
{txt}{space 8}unem {c |}{col 14}{res}{space 2} .3947507{col 26}{space 2} .2848133{col 37}{space 1}    1.39{col 46}{space 3}0.166{col 54}{space 4}-.1634732{col 67}{space 3} .9529745
{txt}{space 9}d90 {c |}{col 14}{res}{space 2} 1.732981{col 26}{space 2} .7478556{col 37}{space 1}    2.32{col 46}{space 3}0.020{col 54}{space 4} .2672106{col 67}{space 3}  3.19875
{txt}{space 9}d93 {c |}{col 14}{res}{space 2} 1.699913{col 26}{space 2} .7065606{col 37}{space 1}    2.41{col 46}{space 3}0.016{col 54}{space 4} .3150796{col 67}{space 3} 3.084746
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.635132{col 26}{space 2} 2.179451{col 37}{space 1}    2.13{col 46}{space 3}0.033{col 54}{space 4} .3634863{col 67}{space 3} 8.906778
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 8.2056677
     {txt}sigma_e {c |} {res} 3.5214244
         {txt}rho {c |} {res} .84447636{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. mat betare = get(_b)
{txt}
{com}. mat Vre = get(VCE)
{txt}
{com}. 
. //Hausman:
. 
. mat hausman=(betafe[1,1..4]-betare[1,1..4])*invsym(Vfe[1..4,1..4]-Vre[1..4,1..4])*(betafe[1,1..4]-betare[1,1..4])'
{txt}
{com}. mat list hausman
{res}
{txt}symmetric hausman[1,1]
          y1
y1 {res} 5.775724
{reset}
{com}. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\rqamar\Downloads\Reem_Metrics_PS4.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 6 Dec 2023, 15:29:31
{txt}{.-}
{smcl}
{txt}{sf}{ul off}